"""✔ Три друга взяли вещи в поход. Сформируйте
словарь, где ключ — имя друга, а значение —
кортеж вещей. Ответьте на вопросы:
✔ Какие вещи взяли все три друга
✔ Какие вещи уникальны, есть только у одного друга
✔ Какие вещи есть у всех друзей кроме одного
и имя того, у кого данная вещь отсутствует
✔ Для решения используйте операции
с множествами. Код должен расширяться
на любое большее количество друзей."""


things= {'Serg': ('удочка', 'дождевик', 'списки'),
        'Nik': ('дождевик', 'кастрюля', 'спички'),
        'Pit': ('палатка', 'половник', 'спички', 'дождевик')}

# не могу решить

# all_things = set(' ')
# for thing in things.values():
#     list_thing = list(thing)
#     all_things.add(list_thing)
#
# print(all_things)

